"""
Задание 1. Создать список и заполнить его элементами различных типов данных.
Реализовать проверку типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

Пример:
для списка [5, "string", 0.15, True, None]
результат

<class 'int'>
<class 'str'>
<class 'float'>
<class 'bool'>
<class 'NoneType'>
"""

for ind, el in enumerate([10, 20, 12.34, 55.07, 'abc', 'EFG', [1, 2, 3]], 1):
    print(f"{ind}) {el}: type of element is {type(el)}\n")
